package fib

/*
架构模式

Pip-Filter架构：

适合数据处理，数据分析

![20200131158048235954296.png](http://image.tyrad.cc/20200131158048235954296.png)

相当于一个一个filter，对数据进行处理。

- 非常适合与数据处理及数据分析系统
- Filter疯转数据处理的功能
- 松耦合：Filter只和数据（格式）耦合
- Pipe用于连接Filter传递数据或者在异步处理过程中缓冲数据流
	- 进程内同步调用时，pipe演变为数据在方法调用间传递

![20200131158048264844481.png](http://image.tyrad.cc/20200131158048264844481.png)
![20200131158048265315848.png](http://image.tyrad.cc/20200131158048265315848.png)


micro-kernel framework

![2020020115805305425749.png](http://image.tyrad.cc/2020020115805305425749.png)

特点:
- 易于扩展
- 错误隔离
- 保持架构一致性

要点
内核包含公共流程或通用逻辑
将可变或可扩展部门规划为扩展点
抽象扩展行为，定义接口
利用插件进行扩展

*/
